Remove plantuml from markdown
