--- a/gnss/gnss.md
+++ b/gnss/gnss.md
@@ -143,15 +119,12 @@ The implementation is stored in the `FileSourceBase` class.
 | `freq` | long | Frequency of the recorded signal |
 | `gain` | int | Gain |
 
-~~~plantuml
-: file_source;
-if (throttle?) then (yes)
-    :throttle;
-endif
-if (dump?) then (yes)
-    :file_sink;
-endif
-: sensor_out;
+Internally this is configured as a flowgraph with a file_source, potentially a throttle (enable_throttle_control) and file_sink (dump)
+
+~~~mermaid
+flowchart LR
+    file_source(file_source) --> throttle --> file_sink(dump/filesink)
+    throttle --> SensorOut
 ~~~
 
 ### UhdSignalSource
